# КВАНТОВАЯ ЗАЩИТА (Твоя физическая идея)

# Задаем массу для проверки (можно менять)
mass = 0

if mass <= 0:
    # Если масса равна нулю или меньше, останавливаем коллапс!
    # Черная дыра превращается в стабильный квантовый кристалл с температурой 1.00
    temperature_old = "ВЗРЫВ (деление на 0)"
    my_formula = 1.00
    print(
        f"Масса: {mass:<13} | Старая физика: {temperature_old:<26} | Твоя идея: {my_formula:.2f}"
    )

else:
    # Для любой обычной массы считаем как обычно
    temperature_old = f"{1 / mass:.2f}"
    # Твоя формула с квантовой поправкой (минус-фильтр), которая спасает математику
    my_formula = (1 / mass) - (1 / (mass + (mass**2)))
    print(
        f"Масса: {mass:<13} | Старая физика: {temperature_old:<26} | Твоя идея: {my_formula:.2f}"
    )
